OpenDTEF-v2012/tutorials/combustion/XiDyMFoam/annularCombustorTurbine/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

./Allrun.mesh

restore0Dir

runApplication decomposePar -force

runParallel potentialFoam -pName pPotential -initialiseUBCs

runParallel XiDyMFoam

#------------------------------------------------------------------------------
